       01  FILE-NAME                     PIC X(14).
       01  CURSOR-POSITION	         PIC 9(4) VALUE ZERO.
       01  INDICATORS.
	   02 KEY-CHANGED	         PIC X(1).
	   02 DATA-CHANGED	         PIC X(1).
       01  COMMENT		         PIC X(75) VALUE SPACE.
       01  FILE-STATUS.
	   02 STATUS-1		         PIC X.
	   02 STATUS-2		         PIC X.
       01  BINARY-NO REDEFINES FILE-STATUS PIC 9(4) COMP.
       01  BINARY-FIELD.
	   02 BINARY-ZERO	         PIC X.
	   02 BINARY-CHAR	         PIC X.
           02 DECIMAL-NO                 PIC 9(3).
       01  OUT-STATUS                    PIC 9.
       01  LOCKED PIC X VALUE "D".
       01  OPTION                        PIC 9.
       01  DISPLAY-FLAG                  PIC 9 VALUE 1.
       01  CONFIRM                       PIC X.
       77  ESCAPE-CHAR                   PIC X   VALUE X"1B".
       77  GET-CHAR                      PIC X  VALUE X"83".
       77  KEYBOARD-CHAR                 PIC X.
      /
       PROCEDURE DIVISION.
	   PERFORM SET-UP-FILE-NAME.
	   OPEN I-O INDEXED-FILE.
	   PERFORM CHECK-STATUS.

       INITIAL-DISPLAY.
	   PERFORM DISPLAY-FORM.
	   PERFORM CLEAR-KEY THRU CLEAR-DATA.
	   MOVE "1.DISPLAY/2.MODIFY/3.INSERT/4.DELETE/5.EXIT" TO COMMENT.
	   DISPLAY COMMENT AT COMMENT-POSITION.
	   PERFORM MAIN-LOOP UNTIL OPTION = 5.
	   GO TO CLOSE-DOWN.

       MAIN-LOOP.
	   ACCEPT OPTION AT 2350.
           IF OPTION = 5
	       GO TO CLOSE-DOWN.
	   MOVE SPACE TO KEYBOARD-CHAR.
	   IF OPTION = 1
	       PERFORM DISP-RECORD THRU END-RUN UNTIL KEYBOARD-CHAR = ESCAPE-CHAR.
	   IF OPTION = 2
	       PERFORM MODIFY-RECORD THRU MODIFY-EXIT UNTIL KEYBOARD-CHAR = ESCAPE-CHAR.
	   IF OPTION = 3
	       PERFORM INSERT-RECORD THRU INSERT-EXIT UNTIL KEYBOARD-CHAR = ESCAPE-CHAR.
	   IF OPTION = 4
	       PERFORM DELETE-RECORD THRU DELETE-EXIT UNTIL KEYBOARD-CHAR = ESCAPE-CHAR.
	   MOVE SPACES TO REC-KEY.
	   START INDEXED-FILE KEY IS GREATER THAN REC-KEY.
	   MOVE ZERO TO CURSOR-POSITION.
	   DISPLAY SPACE UPON CRT.
	   GO TO INITIAL-DISPLAY.

       CLOSE-DOWN.
	   DISPLAY SPACE UPON CRT.
	   CLOSE INDEXED-FILE.
	   DISPLAY "RUN TERMINATED" UPON CONSOLE.
	   STOP RUN.

       DISP-RECORD.
           MOVE KEY-BEGIN TO CURSOR-POSITION.
	   MOVE INDEXED-RECORD TO SAVED-REC.
           PERFORM SET-UP-SCREEN THRU DISPLAY-RECORD.
	   PERFORM CLEAR-COMMENT.
	   MOVE "Press [Esc] to go back / [Enter] to continue" TO COMMENT.
	   DISPLAY COMMENT AT COMMENT-POSITION.
	   CALL GET-CHAR USING KEYBOARD-CHAR.
	   IF KEYBOARD-CHAR = ESCAPE-CHAR
	       GO TO END-RUN.
	   PERFORM CLEAR-COMMENT.
	   IF OPTION = 1
	       MOVE "Enter key-value / Press [Enter]" TO COMMENT
	       DISPLAY COMMENT AT COMMENT-POSITION
	       PERFORM ACCEPT-RECORD THRU SET-UP-RECORD
	       PERFORM CLEAR-COMMENT.
      	   IF REC-KEY NOT = SAVED-KEY
      	       MOVE "Y" TO KEY-CHANGED
      	   ELSE  MOVE "N" TO KEY-CHANGED.
      	   IF KEY-CHANGED = "Y" 
               PERFORM SEE-IF-RECORD-EXISTS
           ELSE
	       PERFORM SEE-IF-ANY-MORE-RECORDS
	   IF OUT-STATUS = 1
	       MOVE "Record not found - End of file" TO COMMENT
	       PERFORM DISPLAY-COMMENT 
	       MOVE ESCAPE-CHAR TO KEYBOARD-CHAR
	   ELSE
	       MOVE "Press [Enter] to display next record." TO COMMENT
	       PERFORM DISPLAY-COMMENT. 

       END-RUN.
	   EXIT.

	MODIFY-RECORD.
	   PERFORM DISP-RECORD.
           PERFORM SET-UP-SCREEN THRU DISPLAY-RECORD.
	   MOVE INDEXED-RECORD TO SAVED-REC.
	   IF OUT-STATUS = 1 
	       MOVE " End of file" TO COMMENT
	       PERFORM DISPLAY-COMMENT
	       MOVE ESCAPE-CHAR TO KEYBOARD-CHAR
	       GO TO MODIFY-EXIT.
	   MOVE "Press [Esc] to go back / [Enter] to continue" TO COMMENT.
	   DISPLAY COMMENT AT COMMENT-POSITION.
	   CALL GET-CHAR USING KEYBOARD-CHAR.
	   IF KEYBOARD-CHAR = ESCAPE-CHAR
	       GO TO MODIFY-EXIT.
	   PERFORM CLEAR-COMMENT.
	   MOVE "Enter key-value / Press [Enter]" TO COMMENT
	   DISPLAY COMMENT AT COMMENT-POSITION
	   PERFORM ACCEPT-RECORD THRU SET-UP-RECORD.
	   PERFORM CLEAR-COMMENT.
	   IF REC-DATA NOT = SAVED-DATA
	       REWRITE INDEXED-RECORD
	       PERFORM CHECK-STATUS
	       IF OUT-STATUS = 0
	          MOVE "RECORD MODIFIED" TO COMMENT
	       IF OUT-STATUS = 3
	          MOVE "RECORD LOCKED" TO COMMENT
	          MOVE SAVED-REC TO INDEXED-RECORD.
	   PERFORM DISPLAY-COMMENT.
	
	MODIFY-EXIT.
	   EXIT.

       INSERT-RECORD.
           MOVE KEY-BEGIN TO CURSOR-POSITION.
           PERFORM SET-UP-SCREEN THRU DISPLAY-RECORD.
	   PERFORM CLEAR-COMMENT.
	   MOVE "Press [Esc] to go back / [Enter] to continue" TO COMMENT.
	   DISPLAY COMMENT AT COMMENT-POSITION.
	   CALL GET-CHAR USING KEYBOARD-CHAR.
	   IF KEYBOARD-CHAR = ESCAPE-CHAR
	       GO TO INSERT-EXIT.
	   PERFORM CLEAR-COMMENT.
	   MOVE "Enter key-value / Press [Enter]" TO COMMENT
	   DISPLAY COMMENT AT COMMENT-POSITION
	   PERFORM ACCEPT-RECORD THRU SET-UP-RECORD.
	   PERFORM CLEAR-COMMENT.
	   PERFORM SEE-IF-RECORD-EXISTS.
	   IF OUT-STATUS = 0
	       MOVE "Record with this key already exists" TO COMMENT
	       PERFORM DISPLAY-COMMENT
	       MOVE ESCAPE-CHAR TO KEYBOARD-CHAR
	       GO TO INSERT-EXIT.
	   WRITE INDEXED-RECORD.
	   PERFORM CHECK-STATUS.
	   IF OUT-STATUS = 0
	      MOVE "RECORD APPENDED" TO COMMENT
	      PERFORM DISPLAY-COMMENT.
	   MOVE ESCAPE-CHAR TO KEYBOARD-CHAR.

	INSERT-EXIT.
	   EXIT.

	DELETE-RECORD.
           MOVE KEY-BEGIN TO CURSOR-POSITION.
           PERFORM SET-UP-SCREEN THRU DISPLAY-RECORD.
	   PERFORM CLEAR-COMMENT.
	   MOVE "Press [Esc] to go back / [Enter] to continue" TO COMMENT.
	   DISPLAY COMMENT AT COMMENT-POSITION.
	   CALL GET-CHAR USING KEYBOARD-CHAR.
	   IF KEYBOARD-CHAR = ESCAPE-CHAR
	       GO TO DELETE-EXIT.
	   PERFORM CLEAR-COMMENT.
	   MOVE "Enter key-value / Press [Enter]" TO COMMENT
	   DISPLAY COMMENT AT COMMENT-POSITION
	   PERFORM ACCEPT-RECORD THRU SET-UP-RECORD.
	   PERFORM CLEAR-COMMENT.
           PERFORM SEE-IF-RECORD-EXISTS.
	   IF OUT-STATUS = 1
	       MOVE "Record does not exist - [Enter to go back]" TO COMMENT
	       PERFORM DISPLAY-COMMENT
	       MOVE ESCAPE-CHAR TO KEYBOARD-CHAR
	       GO TO DELETE-EXIT.
           PERFORM SET-UP-SCREEN THRU DISPLAY-RECORD.
	   MOVE "Please Confirm to Delete (Y/N)" TO COMMENT.
	   DISPLAY COMMENT AT COMMENT-POSITION.
	   ACCEPT CONFIRM AT 2350.
	   PERFORM CLEAR-COMMENT.
	   IF CONFIRM = "N" OR "n"
	      MOVE ESCAPE-CHAR TO KEYBOARD-CHAR
	      GO TO DELETE-EXIT.
           IF CONFIRM = "Y" OR "y"
	      DELETE INDEXED-FILE
	      PERFORM CHECK-STATUS
	      IF OUT-STATUS = 0
	         MOVE "RECORD DELETED" TO COMMENT
	         PERFORM DISPLAY-COMMENT
	      IF OUT-STATUS = 3
	         MOVE "RECORD LOCKED" TO COMMENT
	         PERFORM DISPLAY-COMMENT.
	    MOVE ESCAPE-CHAR TO KEYBOARD-CHAR.

          DELETE-EXIT.
	     EXIT.

       DISPLAY-COMMENT.
           IF COMMENT NOT = SPACES
              DISPLAY COMMENT AT COMMENT-POSITION 
              STOP " " 
              PERFORM CLEAR-COMMENT.

       SEE-IF-ANY-MORE-RECORDS.
	   START INDEXED-FILE KEY > REC-KEY.
           PERFORM CHECK-STATUS.
           IF OUT-STATUS = 0
	       READ INDEXED-FILE NEXT
               PERFORM CHECK-STATUS.

       SEE-IF-RECORD-EXISTS.
	   READ INDEXED-FILE.
	   PERFORM CHECK-STATUS.
       

       CLEAR-COMMENT.
           MOVE SPACES TO COMMENT.
           DISPLAY COMMENT AT COMMENT-POSITION.

       CHECK-STATUS.
           MOVE STATUS-1 TO BINARY-ZERO.
	   IF STATUS-1 = "0"
              MOVE 0 TO OUT-STATUS.
	   IF STATUS-1 = "1"
              MOVE 2 TO OUT-STATUS.
	   IF STATUS-1 = "2"
              MOVE 1 TO OUT-STATUS.
	   IF STATUS-1 = "9"
              PERFORM LOOK-UP-ERROR THRU LOOK-UP-ERROR-EXIT.

       LOOK-UP-ERROR.
           MOVE LOW-VALUES TO STATUS-1.
           MOVE BINARY-NO TO DECIMAL-NO.
           IF DECIMAL-NO = 68
              MOVE 3 TO OUT-STATUS
              GO TO LOOK-UP-ERROR-EXIT
           ELSE
              MOVE "FILE ACCESS ERROR " TO COMMENT
              PERFORM DISPLAY-COMMENT
              GO TO CLOSE-DOWN.

       LOOK-UP-ERROR-EXIT.
              EXIT.    
      *
       SET-UP-FILE-NAME.
