	IDENTIFICATION DIVISION.
        PROGRAM-ID. INDEX1.
 	ENVIRONMENT DIVISION.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL
	   SELECT INDEX1  ASSIGN TO DISK
 	   FILE ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
	   RECORD KEY IS CDE.
	DATA DIVISION.
	FILE SECTION.
	FD INDEX1
	   LABEL RECORDS ARE STANDARD
	   DATA RECORD IS INREC
	   VALUE OF FILE-ID IS "INDEX1.DAT".
	01 INREC.
	  02 CDE  PIC X(10).
	  02 ITEM PIC X(10).
	  02 QNTY PIC 9(5).
	WORKING-STORAGE SECTION.
	77 F PIC X(1).
	77 CDE1  PIC X(10).
	PROCEDURE DIVISION.
	MAIN.
		OPEN OUTPUT INDEX1.
		PERFORM TEST AFTER UNTIL ( F = 'N' )
			DISPLAY "ENTER ITEM,CDE & QUANTITY"
			ACCEPT ITEM
			ACCEPT CDE
			ACCEPT QNTY
	                PERFORM WRITING
			DISPLAY "CONTINUE(Y/N)"
			ACCEPT F
		END-PERFORM.
		
		CLOSE INDEX1.
		OPEN INPUT INDEX1.
		
		PERFORM TEST AFTER UNTIL ( F = 'N' )
			DISPLAY "ENTER CODE OF ITEM"
			ACCEPT CDE1
			MOVE CDE1 TO CDE OF INREC
			PERFORM READING
			DISPLAY "CONTINUE(Y/N)"
			ACCEPT F
	        END-PERFORM.

		CLOSE INDEX1.
                OPEN INPUT INDEX1.
                DISPLAY "CODE   ITEM   QUANTITY".
                PERFORM SEQ.
                
	WRITING.
	   WRITE INREC INVALID KEY DISPLAY "INVALID RECORD ENTRY" .
	READING.
	   READ INDEX1 RECORD KEY IS CDE OF INREC
	   INVALID KEY DISPLAY "ERROR IN CODE"
           NOT INVALID KEY DISPLAY INREC.

        SEQ.
                READ INDEX1 NEXT RECORD AT END PERFORM PENDING
                NOT AT END  DISPLAY INREC.
                PERFORM SEQ.
        PENDING.
                CLOSE INDEX1.
                STOP RUN.
