	IDENTIFICATION DIVISION.
	PROGRAM-ID. MERGINGT1T2.
	ENVIRONMENT DIVISION.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL
	   SELECT T1 ASSIGN TO DISK
	   ORGANIZATION IS LINE SEQUENTIAL.
	   SELECT T2 ASSIGN TO DISK
	   ORGANIZATION IS LINE SEQUENTIAL.
           SELECT MASTER ASSIGN TO DISK
	   ORGANIZATION IS LINE SEQUENTIAL.	
        DATA DIVISION.
	FILE SECTION.
	FD T1
	   LABEL RECORDS ARE STANDARD
	   VALUE OF FILE-ID IS "T1.DAT"
	   DATA RECORD IS T1REC.
	01 T1REC.
	   02 ITEM PIC X(10).
	   02 CDE  PIC X(10).
	   02 NUM  PIC 9(5).
	   02 QNTY PIC 9(5).
	FD T2
	   LABEL RECORDS ARE STANDARD
	   VALUE OF FILE-ID IS "T2.DAT"
	   DATA RECORD IS T2REC.
        01 T2REC.
	   02 ITEM PIC X(10).
	   02 CDE  PIC X(10).
	   02 NUM  PIC 9(5).
	   02 QNTY PIC 9(5).
	FD MASTER
	   LABEL RECORDS ARE STANDARD
	   VALUE OF FILE-ID IS "MERGE.DAT"
	   DATA RECORD IS MREC.
	01 MREC.
	   02 ITEM PIC X(10).
	   02 CDE  PIC X(10).
	   02 NUM  PIC 9(5).
	   02 QNTY PIC 9(5).
	WORKING-STORAGE SECTION.
	77 T1F PIC X(3).
	77 T2F PIC X(3).
	     
	PROCEDURE DIVISION.
	MAIN.
	   PERFORM OPENING.
	   PERFORM READ-T1T2 UNTIL ( T1F = "NO" OR T2F = "NO" ).
	   IF ( T1F = "NO" AND T2F = "YES" ) PERFORM REMAIN-T2
	   ELSE  
	       IF ( T1F = "YES" AND T2F = "NO") PERFORM REMAIN-T1
	       END-IF
           END-IF.  
	   PERFORM PENDING.

	OPENING.
	   OPEN INPUT T1, T2
	        OUTPUT MASTER.
	   MOVE "YES" TO T1F, T2F.
	   READ T1 AT END MOVE "NO" TO T1F.
	   READ T2 AT END MOVE "NO" TO T2F.
	
	READ-T1T2.
	   IF ( CDE OF T1REC = CDE OF T2REC )  PERFORM EQUALCASE   
	   ELSE 
	       IF ( CDE OF T1REC < CDE OF T2REC )  PERFORM COPY-T1
	       ELSE
	           PERFORM COPY-T2
	       END-IF
	   END-IF.

	EQUALCASE.
	   ADD QNTY OF T1REC TO QNTY OF T2REC.
	   MOVE T2REC TO MREC.
	   WRITE MREC.
	   READ T1 AT END MOVE "NO" TO T1F.
	   READ T2 AT END MOVE "NO" TO T2F.
	   
	
	COPY-T1.
	   MOVE  T1REC TO MREC.
	   WRITE MREC.
	   READ  T1 AT END MOVE "NO" TO T1F.

	COPY-T2.
	   MOVE  T2REC TO MREC.
	   WRITE MREC.
	   READ  T2 AT END MOVE "NO" TO T2F.

	REMAIN-T1.
	   PERFORM COPY-T1 UNTIL T1F = "NO".
	
	REMAIN-T2.
	   PERFORM COPY-T2 UNTIL T2F = "NO".
	
	PENDING.
	   CLOSE MASTER, T1, T2.
           STOP RUN. 

	   
	