        IDENTIFICATION DIVISION.
        PROGRAM-ID. RPT.
        ENVIRONMENT DIVISION.
        INPUT-OUTPUT SECTION.
        FILE-CONTROL
           SELECT INFILE ASSIGN TO DISK
           ORGANIZATION LINE SEQUENTIAL.
           SELECT RPTFILE ASSIGN TO DISK.
        DATA DIVISION.
        FILE SECTION.
        FD INFILE
            LABEL RECORDS ARE STANDARD
            DATA RECORD IS IREC
            VALUE OF FILE-ID IS "XYZ.DAT".
        01 IREC.
            02 ZONE PIC X(3).
            02 DST  PIC X(10).
            02 NAM  PIC X(10).
            02 SAL  PIC 9(5).
        FD RPTFILE REPORT IS XYX.
        WORKING-STORAGE SECTION.
        77 PNAM PIC X(10).
        77 PDST PIC X(10).
        77 PZONE PIC X(3).
        REPORT SECTION.
        RD XYX
           CONTROLS ARE FINAL, ZONE, DST, NAM, PAGE LIMIT IS 59 LINES
           HEADING 3
           FOOTING 58
           FIRST DETAIL 8 LAST DETAIL 57.
        01 TYPE RH .
           02 LINE NUMBER 3 COLUMN 5 PIC X(20) VALUE "REPORT ON SALES".
          
        01 HD TYPE IS PAGE HEADING.
           02 LINE NUMBER 5.
              03 COLUMN NUMBER 10 PIC X(10) VALUE "PAGE-NO:".
              03 COLUMN NUMBER 21 PIC ZZ9 SOURCE IS PAGE-COUNTER.

        01 ZH TYPE CH ZONE.
           02 LINE NUMBER IS PLUS 1.
             03 COLUMN NUMBER IS 1 PIC X(132) VALUE ALL SPACES.
        01 DH TYPE CH DST.
           02 LINE NUMBER IS PLUS 1.
             03 COLUMN NUMBER IS 1 PIC X(132) VALUE ALL SPACES.

        01 NAMH TYPE CH NAM.
         02 LINE NUMBER IS PLUS 1.
           03 COLUMN NUMBER 5 PIC X(10) VALUE "ZONE".
           03 COLUMN NUMBER 15 PIC X(10) VALUE "DISTRICT".
           03 COLUMN NUMBER 25 PIC X(10) VALUE "NAME".
           03 COLUMN NUMBER 35 PIC X(10) VALUE "SALES".
         02 LINE NUMBER IS PLUS 1.
           03 COLUMN NUMBER 1 PIC X(132) VALUE ALL SPACES.

        01 DET TYPE DETAIL.
          02 LINE NUMBER IS PLUS 1.
           03 COLUMN NUMBER 5 PIC X(10)  SOURCE IS ZONE.
           03 COLUMN NUMBER 15 PIC X(10) SOURCE IS DST.
           03 COLUMN NUMBER 25 PIC X(10) SOURCE IS NAM.
           03 COLUMN NUMBER 35 PIC X(10) SOURCE IS SAL.

        01 S1 TYPE CF NAM.
           02 LINE NUMBER PLUS 1.
              03 COLUMN NUMBER 10 PIC X(20) VALUE ALL "*".
           02 LINE NUMBER PLUS 1.
              03 COLUMN NUMBER 10 PIC X(10) VALUE "SALE OF:".
              03 COLUMN NUMBER 20 PIC X(10) SOURCE IS PNAM.
              03 TOT1 COLUMN NUMBER 30 PIC 9(5) SUM SAL RESET ON NAM.
           02 LINE NUMBER PLUS 1.
              03 COLUMN NUMBER 10 PIC X(20) VALUE ALL "*".
        01 S2 TYPE CF DST.
           02 LINE NUMBER PLUS 1.
              03 COLUMN NUMBER 10 PIC X(20) VALUE ALL "*".
           02 LINE NUMBER PLUS 1.
              03 COLUMN NUMBER 10 PIC X(15) VALUE "SALE IN DST:".
              03 COLUMN NUMBER 25 PIC X(10) SOURCE IS PDST.
              03 TOT2 COLUMN NUMBER 35 PIC 9(5) SUM TOT1 RESET ON DST.
           02 LINE NUMBER PLUS 1.
              03 COLUMN NUMBER 10 PIC X(20) VALUE ALL "*".
        01 S3 TYPE CF ZONE.
           02 LINE NUMBER PLUS 1.
              03 COLUMN NUMBER 10 PIC X(20) VALUE ALL "*".
           02 LINE NUMBER PLUS 1.
              03 COLUMN NUMBER 10 PIC X(15) VALUE "SALE IN ZONE:".
              03 COLUMN NUMBER 25 PIC X(10) SOURCE IS PZONE.
              03 TOT3 COLUMN NUMBER 35 PIC 9(5) SUM TOT2 RESET ON ZONE.
           02 LINE NUMBER PLUS 1.
              03 COLUMN NUMBER 10 PIC X(20) VALUE ALL "*".

        01 TYPE CF FINAL.
           02 LINE NUMBER 30 ON NEXT PAGE.
              03 COLUMN NUMBER 10 PIC X(20) VALUE ALL "*".
           02 LINE NUMBER PLUS 1.
              03 COLUMN NUMBER 10 PIC X(15) VALUE "ENTIRE SALES:".
              03 COLUMN NUMBER 30 PIC Z(10) SUM TOT3.
           02 LINE NUMBER PLUS 1.
              03 COLUMN NUMBER 10 PIC X(20) VALUE ALL "*".

        PROCEDURE DIVISION.
        P1.
                OPEN INPUT INFILE, OUTPUT RPTFILE.
                INITIATE XYX.
        P2.
                READ INFILE AT END PERFORM P3.
                GENERATE DET.
                MOVE NAM TO PNAM.
                MOVE DST TO PDST.
                MOVE ZONE TO PZONE.
                PERFORM P2.
        P3.
                TERMINATE XYX.
                CLOSE INFILE,RPTFILE.
                STOP RUN.
