	IDENTIFICATION DIVISION.
	PROGRAM-ID. REWRITE.
	ENVIRONMENT DIVISION.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL
	   SELECT INFILE ASSIGN TO DISK
	   ORGANIZATION IS LINE SEQUENTIAL.
	   SELECT OUTFILE ASSIGN TO DISK
	   ORGANIZATION IS LINE SEQUENTIAL.
	DATA DIVISION.
	FILE SECTION.
	FD INFILE
	   LABEL RECORDS ARE STANDARD
	   VALUE OF FILE-ID IS "SFILE.DAT"
	   DATA RECORD IS INREC.
	01 INREC.
	   02 NAME PIC X(10).
	   02 MAR1 PIC 9(3).
	   02 MAR2 PIC 9(3).
	   02 MAR3 PIC 9(3).
	FD OUTFILE
	   LABEL RECORDS ARE STANDARD
	   VALUE OF FILE-ID IS "RWFILE.DAT"
	   DATA RECORD IS OUTREC.
        01 OUTREC.
	   02 NAME PIC X(10).
	   02 PIC      X(6).
	   02 AVG PIC  Z(3).9(3).
	WORKING-STORAGE SECTION.
	77 F PIC X(3) VALUE "YES".
	77 T PIC 9(3)V9(3).
	PROCEDURE DIVISION.
	PMAIN.
	   PERFORM P-OPEN.
	   PERFORM READ-WRITE UNTIL F = "NO".
	   PERFORM CLOPEN.
	   DISPLAY "STUDENTS-DETAILS".
	   PERFORM READ-DISP UNTIL F = "NO"
	   PERFORM STOP-P.

	P-OPEN.
	   OPEN INPUT INFILE
	        OUTPUT OUTFILE.
	
	READ-WRITE.
	   READ INFILE AT END MOVE "NO" TO F.
	   IF F = "YES"
	      MOVE NAME OF INREC TO NAME OF OUTREC
	      ADD MAR1, MAR2, MAR3 GIVING T
	      COMPUTE T = T / 3
	      MOVE  T TO AVG OF OUTREC
	      WRITE OUTREC
	   END-IF.
	
 	READ-DISP.
	   READ OUTFILE AT END MOVE "NO" TO F.
	   IF F = "YES" DISPLAY OUTREC.


	CLOPEN.
	   CLOSE OUTFILE, INFILE.
	   OPEN  INPUT OUTFILE.
	   MOVE "YES" TO F.

	STOP-P.
	   CLOSE OUTFILE.
	   STOP RUN. 