	IDENTIFICATION DIVISION.
        PROGRAM-ID. STUDENT.
 	ENVIRONMENT DIVISION.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL
	   SELECT INFILE ASSIGN TO DISK
 	   FILE ORGANIZATION IS LINE SEQUENTIAL.
	DATA DIVISION.
	FILE SECTION.
	FD INFILE
	   LABEL RECORDS ARE STANDARD
	   DATA RECORD IS INREC
	   VALUE OF FILE-ID IS "SFILE.DAT".
	01 INREC.
	  02 NAME PIC X(10).
	  02 MAR1 PIC 9(3).
	  02 MAR2 PIC 9(3).
          02 MAR3 PIC 9(3).
	WORKING-STORAGE SECTION.
	77 F PIC X(3) VALUE "YES".
	77 D PIC X(3) VALUE "YES".
	PROCEDURE DIVISION.
	PMAIN.
           OPEN OUTPUT INFILE.
	   PERFORM PACCEPT UNTIL D = "NO".
	   PERFORM CLOPEN.
           DISPLAY "STUDENT-DETAILS".
	   PERFORM PREAD UNTIL F = "NO".	 		
	   PERFORM PSTOP.
        
	PACCEPT.
	   DISPLAY "ENTER NAME & 3-MARKS".
	   ACCEPT NAME OF INREC.
	   ACCEPT MAR1.
	   ACCEPT MAR2.
	   ACCEPT MAR3.
 	   WRITE  INREC.
	   DISPLAY "YES/NO".
	   ACCEPT D.
	CLOPEN.
	   CLOSE INFILE.
	   OPEN INPUT INFILE.
	PREAD.
	   READ INFILE AT END MOVE "NO" TO F.
	   IF F = "YES" PERFORM PDISP.
	PDISP.
	   DISPLAY INREC.
	PSTOP.
           CLOSE INFILE.
	   STOP RUN.	