	IDENTIFICATION DIVISION.
	PROGRAM-ID. SORTING.
	ENVIRONMENT DIVISION.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL
	   SELECT TRANS ASSIGN TO DISK
	   ORGANIZATION IS LINE SEQUENTIAL.
           SELECT S1-FILE ASSIGN TO DISK.
	   SELECT T1    ASSIGN TO DISK
	   ORGANIZATION IS LINE SEQUENTIAL.
           SELECT T2    ASSIGN TO DISK
	   ORGANIZATION IS LINE SEQUENTIAL.	  
           SELECT M1  ASSIGN TO DISK
	   ORGANIZATION IS  LINE SEQUENTIAL.
      	   SELECT S2-FILE  ASSIGN TO DISK.
      	DATA DIVISION.
	FILE SECTION.
	SD S1-FILE
	   DATA RECORD IS S1REC.
	01 S1REC.
	   02 CDE PIC X(10).
	   02 FILLER PIC X(5).
	SD S2-FILE
	   DATA RECORD IS S2REC.
	01 S2REC.
      	   02 FILLER PIC X(10).
	   02 CDE    PIC X(10).
      	   02 FILLER PIC X(10).
        FD TRANS
	   LABEL RECORDS ARE STANDARD
	   VALUE OF FILE-ID IS "TRANS.DAT"
	   DATA RECORD IS TREC.
	01 TREC.
	   02 CDE PIC X(10).
	   02 QNTY PIC 9(5).
	FD M1
      	   LABEL RECORDS ARE STANDARD
	   VALUE OF FILE-ID IS "EMPFILE.DAT"
	   DATA RECORD IS MREC.
	01 MREC.
       	   02 ITEM PIC X(10).
      	   02 CDE  PIC X(10).
      	   02 NUM  PIC 9(5).
      	   02 QNTY PIC 9(5).
	FD T1
      	   LABEL RECORDS ARE STANDARD
	   VALUE OF FILE-ID IS "T1.DAT"
	   DATA RECORD IS T1REC.
	01 T1REC.
	   02 ITEM PIC X(10).
      	   02 CDE  PIC X(10).
      	   02 NUM  PIC 9(5).
      	   02 QNTY PIC 9(5).
	FD T2
      	   LABEL RECORDS ARE STANDARD
	   VALUE OF FILE-ID IS "T2.DAT"
	   DATA RECORD IS T2REC.
	01 T2REC.
	   02 ITEM PIC X(10).
      	   02 CDE  PIC X(10).
      	   02 NUM  PIC 9(5).
      	   02 QNTY PIC 9(5).       	  	
	
	  
	PROCEDURE DIVISION.
	MAIN.
	   SORT S1-FILE ON ASCENDING KEY CDE OF S1REC USING TRANS GIVING TRANS.
	   SORT S2-FILE ON ASCENDING KEY CDE OF S2REC USING T1 GIVING T1.
	   SORT S2-FILE ON ASCENDING KEY CDE OF S2REC USING T2 GIVING T2.
	   SORT S2-FILE ON ASCENDING KEY CDE OF S2REC USING M1 GIVING M1.
	   STOP RUN.  