	IDENTIFICATION DIVISION.
        PROGRAM-ID. TRANS.
 	ENVIRONMENT DIVISION.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL
	   SELECT INFILE ASSIGN TO DISK
 	   FILE ORGANIZATION IS LINE SEQUENTIAL.
	DATA DIVISION.
	FILE SECTION.
	FD INFILE
	   LABEL RECORDS ARE STANDARD
	   DATA RECORD IS INREC
	   VALUE OF FILE-ID IS "TRANS.DAT".
	01 INREC.
	  02 CDE  PIC X(10).
	  02 QNTY PIC 9(5).
	WORKING-STORAGE SECTION.
	77 F PIC X(3) VALUE "YES".
	77 D PIC X(3) VALUE "YES".
	PROCEDURE DIVISION.
	PMAIN.
           OPEN OUTPUT INFILE.
	   PERFORM PACCEPT UNTIL D = "NO".
	   PERFORM CLOPEN.
           DISPLAY "ITEM DETAILS".
	   PERFORM PREAD UNTIL F = "NO".	 		
	   PERFORM PSTOP.
        
	PACCEPT.
	   DISPLAY "ENTER ITEM CODE & QUANTITY OF TRANSACTED".
	   ACCEPT CDE.
	   ACCEPT QNTY.
 	   WRITE  INREC.
	   DISPLAY "DO YOU WANT TO CONTINUE (YES/NO)".
	   ACCEPT D.
	CLOPEN.
	   CLOSE INFILE.
	   OPEN INPUT INFILE.
	PREAD.
	   READ INFILE AT END MOVE "NO" TO F.
	   IF F = "YES" PERFORM PDISP.
	PDISP.
	   DISPLAY INREC.
	PSTOP.
           CLOSE INFILE.
	   STOP RUN.	