	IDENTIFICATION DIVISION.
        PROGRAM-ID. UPINDEX.
 	ENVIRONMENT DIVISION.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL
	   SELECT INDEX1  ASSIGN TO DISK
 	   FILE ORGANIZATION IS INDEXED
	   ACCESS MODE IS RANDOM
	   RECORD KEY IS CDE OF IREC.
	   SELECT TRAN ASSIGN TO DISK
	   FILE ORGANIZATION IS LINE SEQUENTIAL.	
	DATA DIVISION.
	FILE SECTION.
	FD INDEX1
	   LABEL RECORDS ARE STANDARD
	   DATA RECORD IS IREC
	   VALUE OF FILE-ID IS "INDEX1.DAT".
	01 IREC.
	   02 CDE  PIC X(10).
	   02 ITEM PIC X(10).
	   02 QNTY PIC 9(5).
	FD TRAN
	   LABEL RECORDS ARE STANDARD
	   DATA RECORD IS TREC
	   VALUE OF FILE-ID IS "INDTRAN.DAT".
	01 TREC.
	   02 CDE PIC X(10).
	   02 QNTY PIC 9(5).
	WORKING-STORAGE SECTION.
	77 F PIC X(1).
        PROCEDURE DIVISION.
	MAIN.
	   OPEN I-O INDEX1
	        INPUT TRAN.
           PERFORM TEST AFTER UNTIL ( F = 'Y' )
			READ TRAN AT END MOVE 'Y' TO F
			NOT AT END PERFORM UPDATING
	   END-PERFORM.
		
	   CLOSE INDEX1.
	   CLOSE TRAN.
	   STOP RUN.

	UPDATING.
	   MOVE CDE OF TREC TO CDE OF IREC.
	   READ INDEX1 RECORD KEY IS CDE OF IREC
	        INVALID KEY DISPLAY "ERROR CODE IN TRANSACTION " ,CDE OF IREC
	        NOT INVALID KEY PERFORM REWRITING
	   END-READ.
	
	REWRITING.
	   ADD QNTY OF TREC TO QNTY OF IREC.
	   REWRITE IREC 
	   INVALID KEY DISPLAY "ERROR IN CODE IN REWRITING"
	   END-REWRITE.	