	IDENTIFICATION DIVISION.
        PROGRAM-ID. UPINDEX.
 	ENVIRONMENT DIVISION.
	INPUT-OUTPUT SECTION.
	FILE-CONTROL
	   SELECT INDEX1  ASSIGN TO DISK
 	   FILE ORGANIZATION IS INDEXED
	   ACCESS MODE IS RANDOM
	   RECORD KEY IS CDE OF IREC.
	   SELECT TRAN ASSIGN TO DISK
	   FILE ORGANIZATION IS LINE SEQUENTIAL.	
	DATA DIVISION.
	FILE SECTION.
	FD INDEX1
	   LABEL RECORDS ARE STANDARD
	   DATA RECORD IS IREC
	   VALUE OF FILE-ID IS "INDEX1.DAT".
	01 IREC.
	   02 CDE  PIC X(10).
	   02 ITEM PIC X(10).
	   02 QNTY PIC 9(5).
	FD TRAN
	   LABEL RECORDS ARE STANDARD
	   DATA RECORD IS TREC
	   VALUE OF FILE-ID IS "INDTRAN1.DAT".
	01 TREC.
	   02 CDE PIC X(10).
	   02 ITEM PIC X(10).
	   02 QNTY PIC 9(5).
	   02 ECODE PIC 9(1).
        88  NEWEMP VALUE 1.
	88  DELEMP VALUE 2.
	88  INCQTY VALUE 3.
        WORKING-STORAGE SECTION.
	77 F PIC X(1).
        PROCEDURE DIVISION.
	MAIN.
	   OPEN I-O INDEX1
	        INPUT TRAN.
           PERFORM TEST AFTER UNTIL ( F = 'Y' )
			READ TRAN AT END MOVE 'Y' TO F
			NOT AT END PERFORM PROCESSINGP
	   END-PERFORM.
		
	   CLOSE INDEX1.
	   CLOSE TRAN.
	   STOP RUN.

	
	
	PROCESSINGP.
	   EVALUATE ECODE
		WHEN 1  PERFORM ADDEMPLOYEE
	        WHEN 2  PERFORM DELEMPLOYEE
	        WHEN 3  PERFORM UPDATING
	  	WHEN OTHER    DISPLAY "ERROR IN TRANSCACTION FILE IN PROCESSING CODE ", ECODE OF TREC
	   END-EVALUATE.
	
	
	ADDEMPLOYEE.
	   MOVE ITEM OF TREC TO ITEM OF IREC.
	   MOVE CDE  OF TREC TO CDE  OF IREC.
	   MOVE QNTY OF TREC TO QNTY OF IREC.
	   WRITE IREC 
		INVALID KEY DISPLAY "ERROR IN CODE IN WRITING PROCESS ", CDE OF IREC 
	   END-WRITE.
	
	DELEMPLOYEE.
	   MOVE CDE OF TREC TO CDE OF IREC.
	   DELETE INDEX1 RECORD 
		INVALID KEY DISPLAY "ERROR IN CODE FOR DELETING RECORD ",CDE OF IREC
	   END-DELETE.
	

	
	UPDATING.
	   MOVE CDE OF TREC TO CDE OF IREC.
	   READ INDEX1 RECORD KEY IS CDE OF IREC
	        INVALID KEY DISPLAY "ERROR CODE IN TRANSACTION " ,CDE OF IREC
	        NOT INVALID KEY PERFORM REWRITING
	   END-READ.
	
	REWRITING.
	   ADD QNTY OF TREC TO QNTY OF IREC.
	   REWRITE IREC
	   INVALID KEY DISPLAY "ERROR IN CODE IN REWRITING"
	   END-REWRITE.	